{"_type": "News", "readLink": "https://api.bing.microsoft.com/api/v7/news/search?q=%22Barry+Caldwell%22%2binbody%3apolice", "queryContext": {"originalQuery": "\"Barry Caldwell\"+inbody:police", "adultIntent": false}, "totalEstimatedMatches": 5, "sort": [{"name": "Best match", "id": "relevance", "isSelected": true, "url": "https://api.bing.microsoft.com/api/v7/news/search?q=%22Barry+Caldwell%22%2binbody%3apolice"}, {"name": "Most recent", "id": "date", "isSelected": false, "url": "https://api.bing.microsoft.com/api/v7/news/search?q=%22Barry+Caldwell%22%2binbody%3apolice&sortby=date"}], "value": [{"name": "Enemies of Atlantic City mayor seek to spark confrontation outside his home", "url": "https://pressofatlanticcity.com/news/local/enemies-of-atlantic-city-mayor-seek-to-spark-confrontation-outside-his-home/article_22fede78-c09d-11eb-a1a4-071e3b7734a8.html", "image": {"thumbnail": {"contentUrl": "https://www.bing.com/th?id=OVFT.XwfCcfTJJRIIMMRr57Z3PS&pid=News", "width": 700, "height": 393}}, "description": "Demonstrators rally Saturday outside the Pennsylvania Avenue School in Atlantic City. On May 29 2021, in front of the Pennsylvania Ave. School in Atlantic City, Steve Young held a small rally and protest directed at Mayor Marty Small Sr.", "about": [{"readLink": "https://api.bing.microsoft.com/api/v7/entities/7bb84f44-be50-0cc6-16fb-ba57101ea7ed", "name": "Atlantic City"}], "provider": [{"_type": "Organization", "name": "The Press of Atlantic City", "image": {"thumbnail": {"contentUrl": "https://www.bing.com/th?id=AR_580df1ac0b5724813a293ce5d54402dc&pid=news"}}}], "datePublished": "2021-05-29T19:00:00.0000000Z", "video": {"name": "Enemies of Atlantic City mayor seek to spark confrontation outside his home", "thumbnailUrl": "https://www.bing.com/th?id=OVF.qa1er44C3JttKRmfWzq47A&pid=News", "thumbnail": {"width": 300, "height": 168}}}, {"name": "It's just another masked Monday", "url": "https://www.politico.com/newsletters/new-jersey-playbook/2021/05/17/its-just-another-masked-monday-492866", "description": "At an event Friday, Gov. Phil Murphy ensured that the mask debate will go on. Despite CDC guidance that it’s OK for vaccinated people to eschew masks indoors, the governor says New Jersey “isn’t there yet” on removing the mask mandate. The problem is that when you use CDC guidance to justify so many other state coronavirus policies, people are going to notice when your precautions exceed it. Wearing a mask inside isn’t really a big deal. And I can see how repealing the mandate could become an annoyance for retail staff: If a store keeps a mask policy in place without a statewide mandate, you’ll have annoying wannabe constitutional experts screaming at low-wage staff about how their rights are being violated. So Murphy was keen to highlight the endorsement of the policy by the UFCW, which represents grocery workers. The more important consideration is whether businesses should keep the old social distancing policies in place, considering that for many of them the number of people they can put into the space affects their bottom line. But the mask news was tempered by an announcement just a couple hours later that Murphy will renew his emergency powers just one more time, though apparently some new legislation will still let him keep some. We’ll see how that checks out. My guess is that New Jersey’s mask mandate won’t be in effect too much longer, especially if our neighboring states get rid of it. WHERE’S MURPHY — In Trenton for a 1 p.m. coronavirus press conference. COREXIT — Murphy, lawmakers say they intend to end New Jersey’s public health emergency, by POLITICO’s Katherine Landergan: New Jersey Gov. Phil Murphy and top lawmakers announced late Friday that they intend to soon end the Covid-19 public health emergency that’s been in place for more than a year. The emergency, initially declared March 9, 2020, is ongoing, and Murphy signed an executive order on Friday extending it for another 30 days. However, in a joint press release, Murphy, Senate President Steve Sweeney and Assembly Speaker Craig Coughlin said they are working on legislation that would end the emergency, but at the same time give the administration the ability to maintain some powers. The bill, the three Democrats said, will ensure “the Administration retains necessary tools to manage the ongoing threat to public health, as well as recovery and vaccination efforts,” the joint statement said. JAMEL HOLLEY TO LEAD OUTREACH EFFORT — “NJ nursing home staff lag in COVID vaccinations. Can Murphy force them to get the shot?” by The Record’s Scott Fallon: “Fewer than 60% of nursing home workers in New Jersey have been vaccinated against COVID, a rate that Gov. Phil Murphy called 'unacceptably low' this week. He even suggested he may mandate shots for long-term care staff. If he chooses to go that route, Murphy will be wading into a gray legal area and a thorny political arena. States have wide latitude to impose vaccination mandates, but it often takes a law to do so. Although Murphy's 14-month Public Health Emergency extends him wide executive powers, it is unclear whether he would be able to make such a move without the state Legislature. And since the Pfizer, Moderna and Johnson & Johnson vaccines have been authorized for emergency use only, it has been argued that mandates cannot be upheld until the vaccines receive full federal Food and Drug Administration approval.” PHYSICIAN-ASSISTED SUICIDE — “33 terminally ill people in N.J. ended their lives by using the Aid in Dying law last year,” by NJ Advance Media’s Susan K. Livio: “Most had graduated college, gotten married and were suffering through the final stage of cancer. Nearly all chose to die at home. A total of 33 New Jersey residents with a terminal illness chose to hasten their deaths last year using the state’s relatively new Medical Aid in Dying law, according to a new report by the Office of the Chief State Medical Examiner. Even in a year dominated by the pandemic — which claimed the lives of more than 16,000 New Jerseyans, displacing cancer as the second-most common cause of death — the law’s impact is significant.\" JEFF VAN DREW IS VERY CONCERNED ABOUT THE SANCTITY OF THE BALLOT, FOLKS — “Complaint alleges Callaway assisted with large number of new-ballot requests,” by The Press of Atlantic City’s Michelle Brunetti Post: “Atlantic City political organizer Craig Callaway personally assisted at least 125 people with filling out requests for new or replacement mail-in ballots in the waning days of the November election, according to a recent complaint sent to the state Attorney General’s Office by an active member of the Democratic Party in Atlantic County. The ballots were virtually all delivered to voters via messengers and returned via drop boxes around the county from mid-October to Election Day on Nov. 3, according to data from the Atlantic County Board of Elections. Callaway said Thursday there is no legal limit on the number of ballot applications with which a registered voter may assist. ‘If that’s a problem, they need to change the law. I’m in compliance,’ Callaway said.” WOULD BE THE FIRST PERSON WITH NIPPLE PIERCINGS TO REPRESENT THE DISTRICT SINCE JIM SAXTON — “Millionaire shipbuilder and onetime punk rocker expected to challenge Andy Kim,” by New Jersey Globe’s David Wildstein: “A 38-year-old yacht manufacturer who was one the lead singer in a punk rock band and now teaches yoga has emerged as the leading challenger to Rep. Andy Kim (D-Moorestown) in New Jersey’s 3rd district next year. Robert Healey, Jr., the co-chairman of the South Jersey-based Viking Yacht Company, has been meeting with Republican leaders to line up party support for a congressional bid and is expected to self-fund a major portion of his campaign. ‘Confirming that I’m exploring this run,’ Healey told the New Jersey Globe in a text message. Healey has hired GOP political consultant Chris Russell, the chief strategist for the last two GOP congressmen from the district, former NFL star Jon Runyan (R-Moorestown) and Tom MacArthur (R-Toms River), the NJ Globe has learned … Heavily-tattooed with long hair and nipple piercings, Healey is also a successful businessman and humanitarian.” STATE CAN USE WEED MONEY FOR ROLLING PAPER TRAIL — “N.J. among nation’s worst in making sure elections are secure. Why haven’t we fixed that?” by NJ Advance Media’s Jonathan D. Salant: \"After President Donald Trump and his Republican allies singled out Georgia and Arizona in falsely claiming that the 2020 presidential election was stolen, both states recounted their votes and found no significant problems. That’s not so easy to do in New Jersey after each election. It’s one of just six states that do not require a paper trail that allows election officials to check that voting machines were not hacked and the results not tampered with. ‘New Jersey is increasingly behind the curve here,’ said Mark Lindeman, acting co-director of Verified Voting, a national nonprofit election verification organization. While New Jersey could do an audit last year because so many ballots were cast by mail, that was a one-shot deal due to the coronavirus pandemic. Going forward, the Garden State will remain an outlier unless the state comes up with the estimated $60 million to $80 million needed to replace county voting machines. ‘That’s totally the problem,’ said Eileen Kean, a Monmouth County elections commissioner.’ ‘It’s really a very, very expensive undertaking.’\" NO SMALL MATTER — “Mother of victim of Kayan Frazier sues Smalls, Atlantic City school board,” by The Press of Atlantic City’s Michelle Brunetti Post: “The mother of a child sexually abused by a relative of Mayor Marty Small Sr. and his wife, La’Quetta, is suing the couple, the Board of Education, Superintendent Barry Caldwell and former substitute teacher Kayan Frazier, the relative. The federal lawsuit was filed Thursday by Jane Doe on behalf of John Doe, her minor child. The use of pseudonyms was designed to protect the identity of the child. Frazier, 28, of Somers Point, pleaded guilty in February to one count of child exploitation involving sexual abuse and child pornography of a child identified in criminal charges as ‘Minor Child 1.’ … The federal lawsuit alleges Frazier, a former caseworker at the New Jersey Department of Child Protection and Permanency, sexually abused the child over three years, including in a bathroom inside the Smalls’ home. Frazier was a substitute teacher in the district from 2015 to 2017 while La’Quetta Small was the principal of the Pennsylvania Avenue School … In March, the Smalls filed a slander lawsuit in Atlantic County Superior Court against Craig Callaway and five unnamed others for comments Callaway made on local radio programs, claiming the Smalls allowed sexual abuse to happen in their home.” —“Insider heavyweights turn out in support of Atlantic City Mayor Small” ALL ALONSO — Former Murphy aide Alonso advising Hudson Regional owners on Bayonne hospital takeover, by POLITICO’s Sam Sutton: Adam Alonso, a former aide to Gov. Phil Murphy, has been acting as an adviser to Hudson Regional Hospital‘s leadership in its attempt to acquire Bayonne Medical Center, reaching out to public officials and participating in meetings to break a logjam over who will run the city’s lone acute care hospital moving forward. Alonso, who along with another Murphy ally was ousted from a leadership role at last year’s Democratic National Convention for allegedly creating a toxic work environment, said in an interview he isn’t being paid by the Secaucus hospital and characterized his work as unofficial guidance for his friend, Hudson Regional Hospital Chair Yan Moshe, and Nizar Kifaieh, the institution’s president and chief executive. “I have been a part of some meetings but I wouldn’t say I’ve been a part of every meeting,” Alonso said. “I’m reaching out to a lot of stakeholders to make sure that they understand Yan and his point of view, but it’s for informational purposes.” DAVIS GETTING POLITICAL ADVICE FROM BAYONNE NATIVE GEORGE R.R. MARTIN — “Political drama in Bayonne: Mayor aiming to oust two councilmembers,” by The Jersey Journal’s Teri West: “Two months after Bayonne Mayor Jimmy Davis hand-selected a candidate to run against his previously hand-picked assemblyman, Davis is apparently doing the same to two councilmembers with whom he won two elections. Multiple Hudson County sources said the mayor is looking to push out City Council President Sharon Nadrowski and Councilman Sal Gullace by running new candidates for their seats next year. Both Nadrowski, who was elected to an at-large seat, and Gullace, who represents the Second Ward, said they still plan to run, even if they won’t have the backing of the Hudson County Democratic Organization (HCDO). The mayor has been interviewing candidates and is eyeing former city Police Officer Lloyd Booker for Nadrowski’s seat, sources said. The mayor denied that he has been interviewing anyone … A rift between Davis and Nadrowski became apparent in recent months, beginning when Nadrowski commented on a gender-based discrimination lawsuit Business Administrator Melissa Mathews filed against the mayor and several other city officials.\" 0.05 MASTROS — “$500,000 in 6 months: In Paterson, City Hall and DPW officials at odds on overtime,” by The Paterson Press’ Joe Malinconico: “Overtime spending in Paterson’s public works department came under intense scrutiny during the past eight months in emails from high-ranking City Hall officials who cited possible double-dipping, improper approvals and insufficient justification and documentation. Among the criticisms was that deputy directors and supervisors were getting weekend overtime hours to perform brief and menial tasks, such as unlocking park gates, which City Hall officials asserted should have been handled by lower-paid employees. The scrutiny triggered several contentious exchanges among Mayor Andre Sayegh’s staff at City Hall and the Department of Public Works. For example, DPW deputy director Steve Howe wrote an email on Sept. 1, 2020 to the business administrator’s office saying “there seems to be a lot of concerns about the ot for both my brother and myself as if you control it. Five months after Howe wrote that email, he submitted an overtime requisition form that said he worked 59.5 consecutive hours from 5 p.m. on Jan. 31 until 4:30 a.m. on Feb. 3 during a massive winter storm. Those hours were part of a two-week pay period in which Howe collected $9,347 in overtime pay for 122 extra hours, according to his city check stub. During that storm, six DPW supervisors were paid for working 95 or more consecutive hours, city records show.” —“Mayor Andre Sayegh’s allies resume One Paterson fundraising as COVID restrictions ease” Did you know that POLITICO Pro has coverage and tools at the state level? All the state legislative and regulatory tracking, budget documents, state agency contact information, and everything else you need to stay ahead of state policy movement integrate into our smart and customizable platform. Learn more and become a Pro today. Thanks to the Governor and Legislature, there’s been pre-k expansion funding in every recent state budget! That’s enabled NJ to expand pre-k for working families into 150+ school districts. However, families in 110+ eligible districts still wait in rural, suburban and urban communities, and from east to west – and north to south. The proposed FY2022 budget would continue to recognize pre-k expansion as a priority for now, and for our future. We agree with former Governor Tom Kean, “There are a few priority reforms we need to make to improve education in our state. One of our highest priorities should be the availability of quality pre-k programs for all of our children. These programs offer our best hope for future success in school and life.” Let’s maintain pre-k expansion as a statewide priority. Continue substantial pre-k expansion in the coming year for New Jersey, and especially for its working families.", "provider": [{"_type": "Organization", "name": "Politico", "image": {"thumbnail": {"contentUrl": "https://www.bing.com/th?id=AR_40e264668889b16b5e1b346ab63eb667&pid=news"}}}], "datePublished": "2021-05-17T11:00:00.0000000Z", "category": "Politics"}, {"name": "Atlantic City school board suspends superintendent search", "url": "https://pressofatlanticcity.com/news/article_7011de9a-c18d-5819-8a1f-d76814bf4e17.html", "description": "ATLANTIC CITY — Invoking the Doctrine of Necessity twice in one meeting, the Atlantic City Board of Education voted Tuesday to suspend its superintendent search and took the first steps", "provider": [{"_type": "Organization", "name": "The Press of Atlantic City"}], "datePublished": "2021-04-28T14:01:00.0000000Z"}, {"name": "Avon man’s life to become a book", "url": "https://www.vaildaily.com/news/avon-mans-life-to-become-a-book/", "description": "“The single element that makes this a great story is the fact that Russell is still alive to tell it,” said filmmaker Barry Caldwell. Co-author Matilda Wren lives in the UK and is the author of crime thriller “When Ravens Fall.” Her new ...", "provider": [{"_type": "Organization", "name": "Vail Daily"}], "datePublished": "2013-03-27T19:44:00.0000000Z"}, {"name": "Colorado resident Kym Rock’s life story is being made into a movie", "url": "https://www.vaildaily.com/news/colorado-resident-kym-rocks-life-story-is-being-made-into-a-movie/", "description": "Hollywood director Barry Caldwell decided that story would make a dandy movie ... Tap it twice and it sends a silent alarm to police with your location. “It can save anyone’s life,” Rock said. She’s also working on a gadget for little kids that ...", "provider": [{"_type": "Organization", "name": "Vail Daily"}], "datePublished": "2013-03-29T22:42:00.0000000Z"}]}